articles/common-lisp-note.org
#+TITLE: Common Lisp - 笔记整理 (草稿)
#+AUTHOR: Xt3
#+OPTIONS: html-postamble:nil html-style:nil tex:nil
#+HTML_DOCTYPE: html5
#+HTML_HEAD:<link href="/testwebsite/css/org.css" rel="stylesheet"></link>


* COMMENT Generate
#+BEGIN_SRC lisp
(twb::gen-with-frame "Common Lisp Note"
                #P"articles/common-lisp-note.html")
#+END_SRC

* 准备
- 实现
  - CCL
  - SBCL
- 编辑器 : Emacs
  - Slime
  - lispy


* 开始
Live 活着的
- 交互能力 实时修改 快速反馈
- REPL : 读 求值 打印 循环
  
** 自身
- 语法 : S-表达式 :
  - 原子 (列表以外的)
  - 列表 (括号括起来的)
- 求值
  - 求值规则
    - 函数 : 参数从左到右先求值 再传入函数求值 
    - 特殊形式 : 各自特定的规则
      - 不求值 : quote
    - 宏 : 参数不求值
      
*** Comment 注释
#+BEGIN_SRC lisp
;;;; File header

;;; Paragraph
(defun foo (x)
  ;; Follow multiple lines
  (bar)
  (ted i)                             ; Current line
  (baz))

#| Multiple lines
    #|
       Nested
    |#
|#
#+END_SRC

** 表示 和 操作
- 表示
  - 数字 : 1 -1 3.14159 3/2 #b1001 #o777 #xAC53
    - 12345678901012345678902012345678903012345678901
  - 字符串 : "我们彼此看着对方" "Hello World"
    - 字符 : #\x #\云  (编码: ASCII Unicode UTF-8)
    - "Hello" == #(#\H #\e #\l #\l #\o)
  - 真值 : t nil
    - 非nil 都为真
  - 名字(变量) : 关联一个对象
    - 比起使用变量这个术语 我更喜欢用名字或标签
    - 变量和常量 : 可不可以修改 名字与对象的关联 (是否可以把名字用到别的对象上) 
    - 符号
  - 过程 : 函数
    - 匿名函数(深藏功与名) : lambda
    - 关联一个名字 : defun
    - 返回值
  - 控制流程 : 顺序 条件分支if cond 循环
  - 复杂对象 : list array hash-table structure class(CLOS)
- 操作
  - 数学计算 : + - * / sin
  - 等等

* 表示
** Number 数
*** Rational 有理数
- Literal
  #+BEGIN_SRC lisp
;;; Integer
123         ;-> 123
-123        ;-> -123
1.          ;-> 1
15511210043330985984000000 ; probably a bignum

#b100       ;-> 4
#o777       ;-> 511
#xD         ;-> 13
;; #nr : base 2~36
#36rABC     ;-> 13368 
  

;;; Ratio
3/7         ;-> 3/7
4/6         ;-> 2/3
6/3         ;-> 2
#b1010/1011 ;-> 10/11  
  #+END_SRC

  
**** Integer 整数
- 类型 : fixnum bignum
  #+BEGIN_SRC lisp
(typep 1 'fixnum) ;-> t
(typep (1+ most-positive-fixnum) 'bignum) ;-> t
  #+END_SRC
- 整数大小无限制 : 内部会自动在必要时分配存储 从而转换到大数表示
- fixnum范围
  #+BEGIN_SRC lisp
(list most-positive-fixnum
      most-negative-fixnum)
;; ( 1152921504606846975
;;  -1152921504606846976)

(expt 2 60) ;-> 1152921504606846976
(expt 2 61) ;-> 2305843009213693952
  #+END_SRC
  
**** Ratio 比值
- Rational canonicalization 规约化 : 6/3 -> 2, 12/6 -> 4/3
- GET : numerator denominator
  #+BEGIN_SRC lisp
(numerator 3/5) ;-> 3
(denominator 3/5) ;-> 5
  #+END_SRC

