articles/common-lisp-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-02-24 Sun 00:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Common Lisp - 笔记整理 (草稿)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Xt3">
<link href="/testwebsite/css/org.css" rel="stylesheet"></link>
</head>
<body>
<div id="content">
<h1 class="title">Common Lisp - 笔记整理 (草稿)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org31f91a1">1. 准备</a></li>
<li><a href="#orgd07b6bd">2. 开始</a>
<ul>
<li><a href="#org6fd6273">2.1. 自身</a>
<ul>
<li><a href="#orgdfc1e8a">2.1.1. Comment 注释</a></li>
</ul>
</li>
<li><a href="#org729be61">2.2. 表示 和 操作</a></li>
</ul>
</li>
<li><a href="#org0acaaa6">3. 表示</a>
<ul>
<li><a href="#org3268adf">3.1. Number 数</a>
<ul>
<li><a href="#org10da4db">3.1.1. Rational 有理数</a></li>
<li><a href="#orga5544de">3.1.2. Float 浮点数</a></li>
<li><a href="#org1cd3f71">3.1.3. Complex 复数</a></li>
</ul>
</li>
<li><a href="#org71dfb12">3.2. Character 字符</a></li>
<li><a href="#org3f09079">3.3. String 字符串</a>
<ul>
<li><a href="#org057c326">3.3.1. GET</a></li>
<li><a href="#org23d2cab">3.3.2. Split &amp; Concat &amp; Join &amp; Trim</a></li>
<li><a href="#org226c826">3.3.3. Search &amp; Replace</a></li>
<li><a href="#org6687de6">3.3.4. Compare</a></li>
<li><a href="#orgce6d446">3.3.5. Regex</a></li>
<li><a href="#org2a38092">3.3.6. Coding</a></li>
<li><a href="#org500e5c9">3.3.7. Other</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge190e6b">4. 基础</a>
<ul>
<li><a href="#org6e0eb9b">4.1. 变量 和 常量</a></li>
<li><a href="#org2538d2f">4.2. 函数</a>
<ul>
<li><a href="#org31e32d2">4.2.1. Call</a></li>
<li><a href="#orgbcd442a">4.2.2. Paramater list</a></li>
<li><a href="#org08c7317">4.2.3. Return Value</a></li>
<li><a href="#org97219f3">4.2.4. Closures</a></li>
</ul>
</li>
<li><a href="#org3a65a93">4.3. 特殊操作符</a></li>
<li><a href="#orge0d0b72">4.4. 宏</a></li>
<li><a href="#org27fd10a">4.5. 控制流</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org31f91a1" class="outline-2">
<h2 id="org31f91a1"><span class="section-number-2">1</span> 准备</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>实现
<ul class="org-ul">
<li>CCL</li>
<li>SBCL</li>
</ul></li>
<li>编辑器 : Emacs
<ul class="org-ul">
<li>Slime</li>
<li>lispy</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgd07b6bd" class="outline-2">
<h2 id="orgd07b6bd"><span class="section-number-2">2</span> 开始</h2>
<div class="outline-text-2" id="text-2">
<p>
Live 活着的
</p>
<ul class="org-ul">
<li>交互能力 实时修改 快速反馈</li>
<li>REPL : 读 求值 打印 循环</li>
</ul>
</div>

<div id="outline-container-org6fd6273" class="outline-3">
<h3 id="org6fd6273"><span class="section-number-3">2.1</span> 自身</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>语法 : S-表达式 :
<ul class="org-ul">
<li>原子 (列表以外的)</li>
<li>列表 (括号括起来的)</li>
</ul></li>
<li>求值
<ul class="org-ul">
<li>求值规则
<ul class="org-ul">
<li>函数 : 参数从左到右先求值 再传入函数求值</li>
<li>特殊形式 : 各自特定的规则
<ul class="org-ul">
<li>不求值 : quote</li>
</ul></li>
<li>宏 : 参数不求值</li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgdfc1e8a" class="outline-4">
<h4 id="orgdfc1e8a"><span class="section-number-4">2.1.1</span> Comment 注释</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;;; </span><span style="color: #8B8989; font-style: italic;">File header</span>

<span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Paragraph</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>x<span style="color: #006400;">)</span>
  <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Follow multiple lines</span>
  <span style="color: #006400;">(</span>bar<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>ted i<span style="color: #006400;">)</span>                             <span style="color: #8B8989; font-style: italic;">; Current line</span>
  <span style="color: #006400;">(</span>baz<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

<span style="color: #8B8989; font-style: italic;">#| </span><span style="color: #8B8989; font-style: italic;">Multiple lines</span>
<span style="color: #8B8989; font-style: italic;">    #|</span>
<span style="color: #8B8989; font-style: italic;">       Nested</span>
<span style="color: #8B8989; font-style: italic;">    |#</span>
<span style="color: #8B8989; font-style: italic;">|#</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org729be61" class="outline-3">
<h3 id="org729be61"><span class="section-number-3">2.2</span> 表示 和 操作</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>表示
<ul class="org-ul">
<li>数字 : 1 -1 3.14159 3/2 #b1001 #o777 #xAC53
<ul class="org-ul">
<li>12345678901012345678902012345678903012345678901</li>
</ul></li>
<li>字符串 : "我们彼此看着对方" "Hello World"
<ul class="org-ul">
<li>字符 : ##\云  (编码: ASCII Unicode UTF-8)</li>
<li>"Hello" == #(#####)</li>
</ul></li>
<li>真值 : t nil
<ul class="org-ul">
<li>非nil 都为真</li>
</ul></li>
<li>名字(变量) : 关联一个对象
<ul class="org-ul">
<li>比起使用变量这个术语 我更喜欢用名字或标签</li>
<li>变量和常量 : 可不可以修改 名字与对象的关联 (是否可以把名字用到别的对象上)</li>
<li>符号</li>
</ul></li>
<li>过程 : 函数
<ul class="org-ul">
<li>匿名函数(深藏功与名) : lambda</li>
<li>关联一个名字 : defun</li>
<li>返回值</li>
</ul></li>
<li>控制流程 : 顺序 条件分支if cond 循环</li>
<li>复杂对象 : list array hash-table structure class(CLOS)</li>
</ul></li>
<li>操作
<ul class="org-ul">
<li>数学计算 : + - * / sin</li>
<li>等等</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0acaaa6" class="outline-2">
<h2 id="org0acaaa6"><span class="section-number-2">3</span> 表示</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org3268adf" class="outline-3">
<h3 id="org3268adf"><span class="section-number-3">3.1</span> Number 数</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-org10da4db" class="outline-4">
<h4 id="org10da4db"><span class="section-number-4">3.1.1</span> Rational 有理数</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li><p>
Literal
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Integer</span>
123         <span style="color: #8B8989; font-style: italic;">;-&gt; 123</span>
-123        <span style="color: #8B8989; font-style: italic;">;-&gt; -123</span>
1.          <span style="color: #8B8989; font-style: italic;">;-&gt; 1</span>
15511210043330985984000000 <span style="color: #8B8989; font-style: italic;">; probably a bignum</span>

#b100       <span style="color: #8B8989; font-style: italic;">;-&gt; 4</span>
#o777       <span style="color: #8B8989; font-style: italic;">;-&gt; 511</span>
#xD         <span style="color: #8B8989; font-style: italic;">;-&gt; 13</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">#nr : base 2~36</span>
#36rABC     <span style="color: #8B8989; font-style: italic;">;-&gt; 13368 </span>
  

<span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Ratio</span>
3/7         <span style="color: #8B8989; font-style: italic;">;-&gt; 3/7</span>
4/6         <span style="color: #8B8989; font-style: italic;">;-&gt; 2/3</span>
6/3         <span style="color: #8B8989; font-style: italic;">;-&gt; 2</span>
#b1010/1011 <span style="color: #8B8989; font-style: italic;">;-&gt; 10/11  </span>
</pre>
</div></li>
</ul>
</div>


<ol class="org-ol"><li><a id="org83b6b73"></a>Integer 整数<br><div class="outline-text-5" id="text-3-1-1-1">
<ul class="org-ul">
<li><p>
类型 : fixnum bignum
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>typep 1 'fixnum<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; t</span>
<span style="color: #8b0000;">(</span>typep <span style="color: #006400;">(</span>1+ most-positive-fixnum<span style="color: #006400;">)</span> 'bignum<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; t</span>
</pre>
</div></li>
<li>整数大小无限制 : 内部会自动在必要时分配存储 从而转换到大数表示</li>
<li><p>
fixnum范围
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>list most-positive-fixnum
      most-negative-fixnum<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">( 1152921504606846975</span>
<span style="color: #8B8989; font-style: italic;">;;  </span><span style="color: #8B8989; font-style: italic;">-1152921504606846976)</span>

<span style="color: #8b0000;">(</span>expt 2 60<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 1152921504606846976</span>
<span style="color: #8b0000;">(</span>expt 2 61<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 2305843009213693952</span>
</pre>
</div></li>
</ul>
</div></li>

<li><a id="org5950688"></a>Ratio 比值<br><div class="outline-text-5" id="text-3-1-1-2">
<ul class="org-ul">
<li>Rational canonicalization 规约化 : 6/3 -&gt; 2, 12/6 -&gt; 4/3</li>
<li><p>
GET : numerator denominator
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>numerator 3/5<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8b0000;">(</span>denominator 3/5<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 5</span>
</pre>
</div></li>
</ul>
</div></li></ol>
</div>
