articles/common-lisp-note.org
*** Float 浮点数
- 实现依赖 [CCL]
- 类型 (precisions, sizes) :  s(short) f(float) d(double) l(long)
- Literal
  #+BEGIN_SRC lisp
1.0      ;-> 1.0
1e0 1s0 1f0      ;-> 1.0
1d0      ;-> 1.0d0

;; float
0.123    ;-> 0.123
.123     ;-> 0.123
123e-3   ;-> 0.123
123E-3   ;-> 0.123
0.123e20 ;-> 1.23e+19
1.33232332329032 ;-> 1.3323233

;; doble
123d23   ;-> 1.23d+25
1.33232332329032d0 ;-> 1.33232332329032D0

2.0/3    ; Error: 2.0/3 被当作一个 symbol name
2/3.0    ;-> 0.6666667
  #+END_SRC
- 范围 (格式:m-s-f) : most-[positive|negative]-long-float
  #+BEGIN_SRC lisp
(list most-negative-short-float
      most-positive-short-float
      most-negative-single-float
      most-positive-single-float
      most-negative-double-float
      most-positive-double-float
      most-negative-long-float
      most-positive-long-float)
;; (-3.4028235E+38 3.4028235E+38
;;  -3.4028235E+38 3.4028235E+38
;;  -1.7976931348623157D+308 1.7976931348623157D+308
;;  -1.7976931348623157D+308 1.7976931348623157D+308)
  #+END_SRC
  
*** Complex 复数
- Literal
  #+BEGIN_SRC lisp
#c(2 1)       ;-> #c(2 1)
#c(2/3 3/4)   ;-> #c(2/3 3/4)

#c(2 1.0)     ;-> #c(2.0 1.0)
#c(2.0 1.0d0) ;-> #c(2.0d0 1.0d0)
#c(1/2 1.0)   ;-> #c(0.5 1.0)

;; complex canonicalization
#c(3 0)       ;-> 3  
#c(1/2 0)     ;-> 1/2
#c(3.0 0.0)   ;-> #c(3.0 0.0)
  #+END_SRC
- GET : realpart imgpart

** Character 字符
- Literal
  #+BEGIN_SRC lisp
#\x      ;-> #\x

;; #\char-name for no-printing (:imp-d)
;;-| Space, Newline, Tab, Page, Rubout, Linefeed, Return, Backspace  
#\Space ;-> #\ 

;; Unicode (实现依赖)
#\U4E91  ; [SBCL]
#\U+4E91 ; [CCL]
;;
#\云 ;-> #\U+4E91  
  #+END_SRC
- 转换 (实现依赖)
  - code-char char-code
  - char-name name-char
    #+BEGIN_SRC lisp
(char-name #\return) ;-> "Return"
(char-name #\U+0) ;-> "Null"
(char-name #\U+123) ;-> "Latin_Small_Letter_G_With_Cedilla"

(name-char "Return") ;-> #\Return
(name-char "Null") ;-> #\Null
(name-char "Latin_Small_Letter_G_With_Cedilla")
;;-> #\Latin_Small_Letter_G_With_Cedilla
    #+END_SRC
** String 字符串
- 表示基于 : Vector-Char : 字符向量
- 创建 : Literal | make-string | make-array(:e-t='character)
  #+BEGIN_SRC lisp
"String"
;; \ : 用于转义 "" \ 
"Str\"ing" ;-> "Str\"ing"
"Str\\ing" ;-> "Str\\ing"

;; 不支持插值语法 和 \n(换行)等转义语法
"Stri\ng"  ;-> "String" 

;; Make
(make-string 3 :initial-element #\c) ;->  "ccc"
(make-array 5 :fill-pointer 0 :adjustable :element-type 'character) ;-> ""
  #+END_SRC  
- 字面值是否可变 ? 实现依赖
  #+BEGIN_SRC lisp
(eq "abc" "abc") ;-> NIL
(setf s0 "abc")
(setf s1 "abc")
(setf (char s0 0) #\1)
(list s0 s1) ;; ("1bc" "abc")

(setf s0 "abc")
(setf s1 s0)
(setf (char s0 0) #\1)
(list s0 s1) ;; ("1bc" "1bc")
  #+END_SRC

*** GET
- 单个元素 : char Vec.schar Arr.aref Seq.elt
  #+BEGIN_SRC lisp
(char "abc" 1) ;-> #\b
(char "云" 0) ;-> #\U+4E91
  #+END_SRC
- 子字符串 : Seq.subseq
- 长度 : Seq.length
  #+BEGIN_SRC lisp
(length "1234567") ;-> 7
(length "一二三四五六七") ;-> 7
(length "ÄÖÜ1") ;-> 4
  #+END_SRC
