articles/common-lisp-note.html

<div id="outline-container-orga5544de" class="outline-4">
<h4 id="orga5544de"><span class="section-number-4">3.1.2</span> Float 浮点数</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>实现依赖 [CCL]</li>
<li>类型 (precisions, sizes) :  s(short) f(float) d(double) l(long)</li>
<li><p>
Literal
</p>
<div class="org-src-container">
<pre class="src src-lisp">1.0      <span style="color: #8B8989; font-style: italic;">;-&gt; 1.0</span>
1e0 1s0 1f0      <span style="color: #8B8989; font-style: italic;">;-&gt; 1.0</span>
1d0      <span style="color: #8B8989; font-style: italic;">;-&gt; 1.0d0</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">float</span>
0.123    <span style="color: #8B8989; font-style: italic;">;-&gt; 0.123</span>
.123     <span style="color: #8B8989; font-style: italic;">;-&gt; 0.123</span>
123e-3   <span style="color: #8B8989; font-style: italic;">;-&gt; 0.123</span>
123E-3   <span style="color: #8B8989; font-style: italic;">;-&gt; 0.123</span>
0.123e20 <span style="color: #8B8989; font-style: italic;">;-&gt; 1.23e+19</span>
1.33232332329032 <span style="color: #8B8989; font-style: italic;">;-&gt; 1.3323233</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">doble</span>
123d23   <span style="color: #8B8989; font-style: italic;">;-&gt; 1.23d+25</span>
1.33232332329032d0 <span style="color: #8B8989; font-style: italic;">;-&gt; 1.33232332329032D0</span>

2.0/3    <span style="color: #8B8989; font-style: italic;">; Error: 2.0/3 &#34987;&#24403;&#20316;&#19968;&#20010; symbol name</span>
2/3.0    <span style="color: #8B8989; font-style: italic;">;-&gt; 0.6666667</span>
</pre>
</div></li>
<li><p>
范围 (格式:m-s-f) : most-[positive|negative]-long-float
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>list most-negative-short-float
      most-positive-short-float
      most-negative-single-float
      most-positive-single-float
      most-negative-double-float
      most-positive-double-float
      most-negative-long-float
      most-positive-long-float<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">(-3.4028235E+38 3.4028235E+38</span>
<span style="color: #8B8989; font-style: italic;">;;  </span><span style="color: #8B8989; font-style: italic;">-3.4028235E+38 3.4028235E+38</span>
<span style="color: #8B8989; font-style: italic;">;;  </span><span style="color: #8B8989; font-style: italic;">-1.7976931348623157D+308 1.7976931348623157D+308</span>
<span style="color: #8B8989; font-style: italic;">;;  </span><span style="color: #8B8989; font-style: italic;">-1.7976931348623157D+308 1.7976931348623157D+308)</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org1cd3f71" class="outline-4">
<h4 id="org1cd3f71"><span class="section-number-4">3.1.3</span> Complex 复数</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li><p>
Literal
</p>
<div class="org-src-container">
<pre class="src src-lisp">#c<span style="color: #8b0000;">(</span>2 1<span style="color: #8b0000;">)</span>       <span style="color: #8B8989; font-style: italic;">;-&gt; #c(2 1)</span>
#c<span style="color: #8b0000;">(</span>2/3 3/4<span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; #c(2/3 3/4)</span>

#c<span style="color: #8b0000;">(</span>2 1.0<span style="color: #8b0000;">)</span>     <span style="color: #8B8989; font-style: italic;">;-&gt; #c(2.0 1.0)</span>
#c<span style="color: #8b0000;">(</span>2.0 1.0d0<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #c(2.0d0 1.0d0)</span>
#c<span style="color: #8b0000;">(</span>1/2 1.0<span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; #c(0.5 1.0)</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">complex canonicalization</span>
#c<span style="color: #8b0000;">(</span>3 0<span style="color: #8b0000;">)</span>       <span style="color: #8B8989; font-style: italic;">;-&gt; 3  </span>
#c<span style="color: #8b0000;">(</span>1/2 0<span style="color: #8b0000;">)</span>     <span style="color: #8B8989; font-style: italic;">;-&gt; 1/2</span>
#c<span style="color: #8b0000;">(</span>3.0 0.0<span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; #c(3.0 0.0)</span>
</pre>
</div></li>
<li>GET : realpart imgpart</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org71dfb12" class="outline-3">
<h3 id="org71dfb12"><span class="section-number-3">3.2</span> Character 字符</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><p>
Literal
</p>
<div class="org-src-container">
<pre class="src src-lisp">#\x      <span style="color: #8B8989; font-style: italic;">;-&gt; #\x</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">#\char-name for no-printing (:imp-d)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-| Space, Newline, Tab, Page, Rubout, Linefeed, Return, Backspace  </span>
#\Space <span style="color: #8B8989; font-style: italic;">;-&gt; #\ </span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Unicode (&#23454;&#29616;&#20381;&#36182;)</span>
#\U4E91  <span style="color: #8B8989; font-style: italic;">; [SBCL]</span>
#\U+4E91 <span style="color: #8B8989; font-style: italic;">; [CCL]</span>
<span style="color: #8B8989; font-style: italic;">;;</span>
#\&#20113; <span style="color: #8B8989; font-style: italic;">;-&gt; #\U+4E91  </span>
</pre>
</div></li>
<li>转换 (实现依赖)
<ul class="org-ul">
<li>code-char char-code</li>
<li><p>
char-name name-char
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>char-name #\return<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "Return"</span>
<span style="color: #8b0000;">(</span>char-name #\U+0<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "Null"</span>
<span style="color: #8b0000;">(</span>char-name #\U+123<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "Latin_Small_Letter_G_With_Cedilla"</span>

<span style="color: #8b0000;">(</span>name-char <span style="color: #61CE3C;">"Return"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #\Return</span>
<span style="color: #8b0000;">(</span>name-char <span style="color: #61CE3C;">"Null"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #\Null</span>
<span style="color: #8b0000;">(</span>name-char <span style="color: #61CE3C;">"Latin_Small_Letter_G_With_Cedilla"</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; #\Latin_Small_Letter_G_With_Cedilla</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3f09079" class="outline-3">
<h3 id="org3f09079"><span class="section-number-3">3.3</span> String 字符串</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>表示基于 : Vector-Char : 字符向量</li>
<li><p>
创建 : Literal | make-string | make-array(:e-t='character)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #61CE3C;">"String"</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">\ : &#29992;&#20110;&#36716;&#20041; "" \ </span>
<span style="color: #61CE3C;">"Str\"ing"</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "Str\"ing"</span>
<span style="color: #61CE3C;">"Str\\ing"</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "Str\\ing"</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#19981;&#25903;&#25345;&#25554;&#20540;&#35821;&#27861; &#21644; \n(&#25442;&#34892;)&#31561;&#36716;&#20041;&#35821;&#27861;</span>
<span style="color: #61CE3C;">"Stri\ng"</span>  <span style="color: #8B8989; font-style: italic;">;-&gt; "String" </span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Make</span>
<span style="color: #8b0000;">(</span>make-string 3 <span style="color: #4c83ff;">:initial-element</span> #\c<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "ccc"</span>
<span style="color: #8b0000;">(</span>make-array 5 <span style="color: #4c83ff;">:fill-pointer</span> 0 <span style="color: #4c83ff;">:adjustable</span> <span style="color: #4c83ff;">:element-type</span> 'character<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; ""</span>
</pre>
</div></li>
<li><p>
字面值是否可变 ? 实现依赖
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>eq <span style="color: #61CE3C;">"abc"</span> <span style="color: #61CE3C;">"abc"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; NIL</span>
<span style="color: #8b0000;">(</span>setf s0 <span style="color: #61CE3C;">"abc"</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>setf s1 <span style="color: #61CE3C;">"abc"</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>setf <span style="color: #006400;">(</span>char s0 0<span style="color: #006400;">)</span> #\1<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>list s0 s1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">("1bc" "abc")</span>

<span style="color: #8b0000;">(</span>setf s0 <span style="color: #61CE3C;">"abc"</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>setf s1 s0<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>setf <span style="color: #006400;">(</span>char s0 0<span style="color: #006400;">)</span> #\1<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>list s0 s1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">("1bc" "1bc")</span>
</pre>
</div></li>
</ul>
</div>

<div id="outline-container-org057c326" class="outline-4">
<h4 id="org057c326"><span class="section-number-4">3.3.1</span> GET</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li><p>
单个元素 : char Vec.schar Arr.aref Seq.elt
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>char <span style="color: #61CE3C;">"abc"</span> 1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #\b</span>
<span style="color: #8b0000;">(</span>char <span style="color: #61CE3C;">"&#20113;"</span> 0<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #\U+4E91</span>
</pre>
</div></li>
<li>子字符串 : Seq.subseq</li>
<li><p>
长度 : Seq.length
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>length <span style="color: #61CE3C;">"1234567"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 7</span>
<span style="color: #8b0000;">(</span>length <span style="color: #61CE3C;">"&#19968;&#20108;&#19977;&#22235;&#20116;&#20845;&#19971;"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 7</span>
<span style="color: #8b0000;">(</span>length <span style="color: #61CE3C;">"&#196;&#214;&#220;1"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 4</span>
</pre>
</div></li>
</ul>
</div>
</div>
