articles/common-lisp-note.org
*** Split & Concat & Join & Trim
- 分隔 Split : cl-ppcre:split
  #+BEGIN_SRC lisp
(split "" "hel lo") ;-> ("h" "e" "l" " " "l" "o")

(split "\\s+" "foo   bar baz frob")
;;-> ("foo" "bar" "baz" "frob")
(ppcre:split "(\\s+)" "foo   bar baz frob" :with-registers-p t)
;;-> ("foo" "   " "bar" " " "baz" " " "frob")

(split "(,)|(;)" "foo,bar;baz" :with-registers-p t)
;;-> ("foo" "," NIL "bar" NIL ";" "baz") ;; ("," nil == mach(,) nomach(;))
(split "(,)|(;)" "foo,bar;baz" :with-registers-p t :omit-unmatched-p t)
;;-> ("foo" "," "bar" ";" "baz")

(split ":" "a:b:c:d:e:f:g::") ;-> ("a" "b" "c" "d" "e" "f" "g")
(split ":" "a:b:c:d:e:f:g::" :limit 0)
;;-> ("a" "b" "c" "d" "e" "f" "g")
(split ":" "a:b:c:d:e:f:g::" :limit 2)
;;-> ("a" "b:c:d:e:f:g::")
(split ":" "a:b:c:d:e:f:g::" :limit 3)
;;-> ("a" "b" "c:d:e:f:g::") 
  #+END_SRC
- 连接 Concat : Imp.concat
  #+BEGIN_SRC lisp
(defun concat (&rest s)
  (apply #'concatenate 'string s))
  #+END_SRC
- 加入 Join : Imp.join
  #+BEGIN_SRC lisp
(defun join (strs &optional (separator " "))
  (reduce (lambda (acc next)
            (format nil "~a~a~a" acc separator next))
       strs))  
  #+END_SRC
- 修剪 Trim : string-trim-[left right]
  #+BEGIN_SRC lisp
(string-trim "abc" "abcaakaaakabcaaa") ;->  "kaaak"
(string-trim '(#\Space #\Tab #\Newline) " garbanzo beans") ;->  "garbanzo beans"
(string-trim " (*)" " ( *three (silly) words* ) ") ;->  "three (silly) words"

(string-left-trim " (*)" " ( *three (silly) words* ) ") ;->  "three (silly) words* ) "
  #+END_SRC

