articles/common-lisp-note.html
<div id="outline-container-org23d2cab" class="outline-4">
<h4 id="org23d2cab"><span class="section-number-4">3.3.2</span> Split &amp; Concat &amp; Join &amp; Trim</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li><p>
分隔 Split : cl-ppcre:split
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">""</span> <span style="color: #61CE3C;">"hel lo"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; ("h" "e" "l" " " "l" "o")</span>

<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">"\\s+"</span> <span style="color: #61CE3C;">"foo   bar baz frob"</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("foo" "bar" "baz" "frob")</span>
<span style="color: #8b0000;">(</span>ppcre:split <span style="color: #61CE3C;">"(\\s+)"</span> <span style="color: #61CE3C;">"foo   bar baz frob"</span> <span style="color: #4c83ff;">:with-registers-p</span> t<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("foo" "   " "bar" " " "baz" " " "frob")</span>

<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">"(,)|(;)"</span> <span style="color: #61CE3C;">"foo,bar;baz"</span> <span style="color: #4c83ff;">:with-registers-p</span> t<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("foo" "," NIL "bar" NIL ";" "baz") ;; ("," nil == mach(,) nomach(;))</span>
<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">"(,)|(;)"</span> <span style="color: #61CE3C;">"foo,bar;baz"</span> <span style="color: #4c83ff;">:with-registers-p</span> t <span style="color: #4c83ff;">:omit-unmatched-p</span> t<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("foo" "," "bar" ";" "baz")</span>

<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">":"</span> <span style="color: #61CE3C;">"a:b:c:d:e:f:g::"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; ("a" "b" "c" "d" "e" "f" "g")</span>
<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">":"</span> <span style="color: #61CE3C;">"a:b:c:d:e:f:g::"</span> <span style="color: #4c83ff;">:limit</span> 0<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("a" "b" "c" "d" "e" "f" "g")</span>
<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">":"</span> <span style="color: #61CE3C;">"a:b:c:d:e:f:g::"</span> <span style="color: #4c83ff;">:limit</span> 2<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("a" "b:c:d:e:f:g::")</span>
<span style="color: #8b0000;">(</span>split <span style="color: #61CE3C;">":"</span> <span style="color: #61CE3C;">"a:b:c:d:e:f:g::"</span> <span style="color: #4c83ff;">:limit</span> 3<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; ("a" "b" "c:d:e:f:g::") </span>
</pre>
</div></li>
<li><p>
连接 Concat : Imp.concat
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">concat</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;rest</span> s<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>apply #'concatenate 'string s<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div></li>
<li><p>
加入 Join : Imp.join
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">join</span> <span style="color: #006400;">(</span>strs <span style="color: #afd8af;">&amp;optional</span> <span style="color: #ff1493;">(</span>separator <span style="color: #61CE3C;">" "</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>reduce <span style="color: #ff1493;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ffff00;">(</span>acc next<span style="color: #ffff00;">)</span>
            <span style="color: #ffff00;">(</span>format nil <span style="color: #61CE3C;">"~a~a~a"</span> acc separator next<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
       strs<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>  
</pre>
</div></li>
<li><p>
修剪 Trim : string-trim-[left right]
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>string-trim <span style="color: #61CE3C;">"abc"</span> <span style="color: #61CE3C;">"abcaakaaakabcaaa"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "kaaak"</span>
<span style="color: #8b0000;">(</span>string-trim '<span style="color: #006400;">(</span>#\Space #\Tab #\Newline<span style="color: #006400;">)</span> <span style="color: #61CE3C;">" garbanzo beans"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "garbanzo beans"</span>
<span style="color: #8b0000;">(</span>string-trim <span style="color: #61CE3C;">" (*)"</span> <span style="color: #61CE3C;">" ( *three (silly) words* ) "</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "three (silly) words"</span>

<span style="color: #8b0000;">(</span>string-left-trim <span style="color: #61CE3C;">" (*)"</span> <span style="color: #61CE3C;">" ( *three (silly) words* ) "</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "three (silly) words* ) "</span>
</pre>
</div></li>
</ul>
</div>
</div>
