articles/common-lisp-note.org
*** Search & Replace
- 匹配 : Seq.(find position) Seq.(search mismatch) cl-ppcre:(scan-[to-strings] all-matches-[as-strings])
  #+BEGIN_SRC lisp
;; 返回 项 或 NIL
(find #\a "foobarbaz") ;-> #\a

;; 返回 位置 或 NIL
(position #\a "foobarbaz") ;-> 4

;; 匹配的第一个位置
(search "bar" "foobarbaz") ;-> 3
(search "Bar" "foobarbaz" :test #'string=) ;-> NIL

;; 不匹配的第一个位置
(mismatch "foobarbaz" "foom")            ;-> 3
;; 不匹配的第一个位置索引+1
(mismatch "foobarbaz" "baz" :from-end t) ;-> 6

;; scan -> match:(start end) register-match:(start end)
(scan "(a)*b" "xaaabd") ;-> 1 ;-> 5 ;-> #(3) ;-> #(4)
(scan-to-strings "(([^b])*)b" "aaabd") ;-> "aaab" ;-> #("aaa" "a")

;; all-matches -> match:(start end)
(all-matches "a" "foo bar baz") ;-> (5 6 9 10)
(all-matches-as-strings "\\d" "bar 3 baz 5") ;-> ("3" "5")
  #+END_SRC
- 替代 : Seq.substitute cl-ppcre:regex-replace-[all]  (破坏 : Seq.replace Seq.fill)
  #+BEGIN_SRC lisp
(substitute #\c #\a "abababab") ;-> "cbcbcbcb"
(substitute #\c #\A "abababab" :test 'string=) ;-> "abababab"

(regex-replace "fo+" "foo bar" "frob")     ;-> "frob bar" ;-> T
;; 忽略大小写匹配
(regex-replace "(?i)fo+" "FOO bar" "frob") ;-> "frob bar" ;-> T
;; 保留目标字符串大小写样式
(regex-replace "(?i)fo+" "Foo bar" "frob" :preserve-case t)
;;-> "Frob bar" ;-> T
(regex-replace-all "(?i)fo+" "foo Fooo FOOOO bar" 
                   "frob" :preserve-case t)
;;-> "frob Frob FROB bar" ;-> T
  #+END_SRC
*** Compare
- 大小写敏感 : string[= /= < > <= >=]
- 不敏感 : string-[equal not-equal lessp greaterp not-greaterp not-lessp]
- 前缀 和 后缀 : Imp.(prefixp suffixp)
  #+BEGIN_SRC lisp
(defun prefixp (start s &key (test #'string=))
  (let ((m (mismatch start s :test test)))
    (or (null m) (= m (length start)))))


(prefixp "foo" "foobarbaz" ) ;-> T
(prefixp "foo" "foo" ) ;-> T
(prefixp "foo" "barbaz" ) ;-> NIL

(defun suffixp (end s &key (test #'string=))
  (case (mismatch end s :from-end t :test test)
    ((0 nil) t)
    (t nil)))

(suffixp "baz" "foobaz" ) ;-> T

  #+END_SRC
*** Regex
- Lib:cl-ppcre
*** Coding
- Lib:[[https://github.com/cl-babel/babel][babel]]

*** Other
- string-[upcase downcase capitalize]
  #+BEGIN_SRC lisp
(string-upcase "abcde") ;->  "ABCDE"
(string-downcase "ABCDE") ;->  "abcde"
(string-capitalize "hello Good MORING") ;-> "Hello Good Moring"
(string-capitalize 'kludgy-hash-search) ;->  "Kludgy-Hash-Search"
(string-capitalize "DON'T!") ;->  "Don'T!" ;: not "Don't!"  
  #+END_SRC
* 基础
