articles/common-lisp-note.html

<div id="outline-container-org226c826" class="outline-4">
<h4 id="org226c826"><span class="section-number-4">3.3.3</span> Search &amp; Replace</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li><p>
匹配 : Seq.(find position) Seq.(search mismatch) cl-ppcre:(scan-[to-strings] all-matches-[as-strings])
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#36820;&#22238; &#39033; &#25110; NIL</span>
<span style="color: #8b0000;">(</span>find #\a <span style="color: #61CE3C;">"foobarbaz"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #\a</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#36820;&#22238; &#20301;&#32622; &#25110; NIL</span>
<span style="color: #8b0000;">(</span>position #\a <span style="color: #61CE3C;">"foobarbaz"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 4</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#21305;&#37197;&#30340;&#31532;&#19968;&#20010;&#20301;&#32622;</span>
<span style="color: #8b0000;">(</span>search <span style="color: #61CE3C;">"bar"</span> <span style="color: #61CE3C;">"foobarbaz"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8b0000;">(</span>search <span style="color: #61CE3C;">"Bar"</span> <span style="color: #61CE3C;">"foobarbaz"</span> <span style="color: #4c83ff;">:test</span> #'string=<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; NIL</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#19981;&#21305;&#37197;&#30340;&#31532;&#19968;&#20010;&#20301;&#32622;</span>
<span style="color: #8b0000;">(</span>mismatch <span style="color: #61CE3C;">"foobarbaz"</span> <span style="color: #61CE3C;">"foom"</span><span style="color: #8b0000;">)</span>            <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#19981;&#21305;&#37197;&#30340;&#31532;&#19968;&#20010;&#20301;&#32622;&#32034;&#24341;+1</span>
<span style="color: #8b0000;">(</span>mismatch <span style="color: #61CE3C;">"foobarbaz"</span> <span style="color: #61CE3C;">"baz"</span> <span style="color: #4c83ff;">:from-end</span> t<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 6</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">scan -&gt; match:(start end) register-match:(start end)</span>
<span style="color: #8b0000;">(</span>scan <span style="color: #61CE3C;">"(a)*b"</span> <span style="color: #61CE3C;">"xaaabd"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 1 ;-&gt; 5 ;-&gt; #(3) ;-&gt; #(4)</span>
<span style="color: #8b0000;">(</span>scan-to-strings <span style="color: #61CE3C;">"(([</span><span style="color: #61CE3C;">^</span><span style="color: #61CE3C;">b])*)b"</span> <span style="color: #61CE3C;">"aaabd"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "aaab" ;-&gt; #("aaa" "a")</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">all-matches -&gt; match:(start end)</span>
<span style="color: #8b0000;">(</span>all-matches <span style="color: #61CE3C;">"a"</span> <span style="color: #61CE3C;">"foo bar baz"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (5 6 9 10)</span>
<span style="color: #8b0000;">(</span>all-matches-as-strings <span style="color: #61CE3C;">"\\d"</span> <span style="color: #61CE3C;">"bar 3 baz 5"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; ("3" "5")</span>
</pre>
</div></li>
<li><p>
替代 : Seq.substitute cl-ppcre:regex-replace-[all]  (破坏 : Seq.replace Seq.fill)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>substitute #\c #\a <span style="color: #61CE3C;">"abababab"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "cbcbcbcb"</span>
<span style="color: #8b0000;">(</span>substitute #\c #\A <span style="color: #61CE3C;">"abababab"</span> <span style="color: #4c83ff;">:test</span> 'string=<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "abababab"</span>

<span style="color: #8b0000;">(</span>regex-replace <span style="color: #61CE3C;">"fo+"</span> <span style="color: #61CE3C;">"foo bar"</span> <span style="color: #61CE3C;">"frob"</span><span style="color: #8b0000;">)</span>     <span style="color: #8B8989; font-style: italic;">;-&gt; "frob bar" ;-&gt; T</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#24573;&#30053;&#22823;&#23567;&#20889;&#21305;&#37197;</span>
<span style="color: #8b0000;">(</span>regex-replace <span style="color: #61CE3C;">"(?i)fo+"</span> <span style="color: #61CE3C;">"FOO bar"</span> <span style="color: #61CE3C;">"frob"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "frob bar" ;-&gt; T</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#20445;&#30041;&#30446;&#26631;&#23383;&#31526;&#20018;&#22823;&#23567;&#20889;&#26679;&#24335;</span>
<span style="color: #8b0000;">(</span>regex-replace <span style="color: #61CE3C;">"(?i)fo+"</span> <span style="color: #61CE3C;">"Foo bar"</span> <span style="color: #61CE3C;">"frob"</span> <span style="color: #4c83ff;">:preserve-case</span> t<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; "Frob bar" ;-&gt; T</span>
<span style="color: #8b0000;">(</span>regex-replace-all <span style="color: #61CE3C;">"(?i)fo+"</span> <span style="color: #61CE3C;">"foo Fooo FOOOO bar"</span> 
                   <span style="color: #61CE3C;">"frob"</span> <span style="color: #4c83ff;">:preserve-case</span> t<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; "frob Frob FROB bar" ;-&gt; T</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org6687de6" class="outline-4">
<h4 id="org6687de6"><span class="section-number-4">3.3.4</span> Compare</h4>
<div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li>大小写敏感 : string[= /= &lt; &gt; &lt;= &gt;=]</li>
<li>不敏感 : string-[equal not-equal lessp greaterp not-greaterp not-lessp]</li>
<li><p>
前缀 和 后缀 : Imp.(prefixp suffixp)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">prefixp</span> <span style="color: #006400;">(</span>start s <span style="color: #afd8af;">&amp;key</span> <span style="color: #ff1493;">(</span>test #'string=<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span>m <span style="color: #00ff00;">(</span>mismatch start s <span style="color: #4c83ff;">:test</span> test<span style="color: #00ff00;">)</span><span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">(</span>or <span style="color: #ffff00;">(</span>null m<span style="color: #ffff00;">)</span> <span style="color: #ffff00;">(</span>= m <span style="color: #00ff00;">(</span>length start<span style="color: #00ff00;">)</span><span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>


<span style="color: #8b0000;">(</span>prefixp <span style="color: #61CE3C;">"foo"</span> <span style="color: #61CE3C;">"foobarbaz"</span> <span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; T</span>
<span style="color: #8b0000;">(</span>prefixp <span style="color: #61CE3C;">"foo"</span> <span style="color: #61CE3C;">"foo"</span> <span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; T</span>
<span style="color: #8b0000;">(</span>prefixp <span style="color: #61CE3C;">"foo"</span> <span style="color: #61CE3C;">"barbaz"</span> <span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; NIL</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">suffixp</span> <span style="color: #006400;">(</span>end s <span style="color: #afd8af;">&amp;key</span> <span style="color: #ff1493;">(</span>test #'string=<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">case</span> <span style="color: #ff1493;">(</span>mismatch end s <span style="color: #4c83ff;">:from-end</span> t <span style="color: #4c83ff;">:test</span> test<span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span>0 nil<span style="color: #ffff00;">)</span> t<span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">(</span>t nil<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

<span style="color: #8b0000;">(</span>suffixp <span style="color: #61CE3C;">"baz"</span> <span style="color: #61CE3C;">"foobaz"</span> <span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; T</span>

</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgce6d446" class="outline-4">
<h4 id="orgce6d446"><span class="section-number-4">3.3.5</span> Regex</h4>
<div class="outline-text-4" id="text-3-3-5">
<ul class="org-ul">
<li>Lib:cl-ppcre</li>
</ul>
</div>
</div>
<div id="outline-container-org2a38092" class="outline-4">
<h4 id="org2a38092"><span class="section-number-4">3.3.6</span> Coding</h4>
<div class="outline-text-4" id="text-3-3-6">
<ul class="org-ul">
<li>Lib:<a href="https://github.com/cl-babel/babel">babel</a></li>
</ul>
</div>
</div>

<div id="outline-container-org500e5c9" class="outline-4">
<h4 id="org500e5c9"><span class="section-number-4">3.3.7</span> Other</h4>
<div class="outline-text-4" id="text-3-3-7">
<ul class="org-ul">
<li><p>
string-[upcase downcase capitalize]
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>string-upcase <span style="color: #61CE3C;">"abcde"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "ABCDE"</span>
<span style="color: #8b0000;">(</span>string-downcase <span style="color: #61CE3C;">"ABCDE"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "abcde"</span>
<span style="color: #8b0000;">(</span>string-capitalize <span style="color: #61CE3C;">"hello Good MORING"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; "Hello Good Moring"</span>
<span style="color: #8b0000;">(</span>string-capitalize 'kludgy-hash-search<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "Kludgy-Hash-Search"</span>
<span style="color: #8b0000;">(</span>string-capitalize <span style="color: #61CE3C;">"DON'T!"</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;  "Don'T!" ;: not "Don't!"  </span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
