articles/common-lisp-note.org
** 变量 和 常量
Variable 变量
- Global (Dynamic) : defparameter defvar  (命名约定: ~*name*~)
  #+BEGIN_SRC lisp
;;; defparameter
(defparameter *foo* 5)
(defparameter *foo* (+ 1 2))            ; *foo* == 3

;;; defvar
(defvar *bar* 5) ; *bar* = 5
;; 重定义不改变之前定义时的值
(defvar *bar* 6) ; *bar* == 5
;; 定义时可以不设置值
(defvar *bar*) ; *bar* == Unbound
    #+END_SRC      
- Local : let let*(可引用变量列表中早先引入的变量)
  #+BEGIN_SRC lisp
;; let
(let ((a 5) 􏰅
      (b 6))
  (+ a b))
;;-> 11

;; let*
(let* ((a 5)
       (b (+ a 2)))
  b)
;;-> 7
      #+END_SRC

Constant 常量
- defconstant (命名约定: ~+name+~)
  #+BEGIN_SRC lisp
(defconstant +name+ initial-value-form (doucmentation-string))  
  #+END_SRC


Dynamic (Special) Variable  (!!! 注意命名)
- all global variable are dynamic variable  
- Lexical scope & Dynamic extent variable 词法范围 和 动态作用域 变量
  #+BEGIN_SRC lisp
;; Lexical scope variable
(let ((x 3))
  (defun test () x))
(test)                ;-> 3
(let ((x 5)) (test))  ;-> 3

;; Dynamic extent variable
(defvar *special* 3)
(defun test () *special*)
(test) ;-> 3
(let ((*special* 5)) (test)) ;-> 5


;; !!! 注意命名 : 否则难以分清 可导致使用错误
(defparameter x 3)

(defun test () x)
(test) ;-> 3
(let ((x 0)) (test))  ;-> 0

(let ((x 1))
  (defun test () x))
(test) ;-> 3
(let ((x 0)) (test)) ;-> 0
    #+END_SRC
- Special: (declare (special ..))
  #+BEGIN_SRC lisp
(let ((y 1))
  (defun test () y))
(test) ;-> 1
(let ((y 1))
  (defun test ()
    (declare (special y))
    y))
(test)  ;-> Error: Unbound y
(progn (defparameter y 3)
       (test))
;;-> 3
  #+END_SRC

