articles/common-lisp-note.html
<div id="outline-container-orge190e6b" class="outline-2">
<h2 id="orge190e6b"><span class="section-number-2">4</span> 基础</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org6e0eb9b" class="outline-3">
<h3 id="org6e0eb9b"><span class="section-number-3">4.1</span> 变量 和 常量</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Variable 变量
</p>
<ul class="org-ul">
<li><p>
Global (Dynamic) : defparameter defvar  (命名约定: <code>*name*</code>)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">defparameter</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defparameter</span> <span style="color: #ff69b4;">*foo*</span> 5<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defparameter</span> <span style="color: #ff69b4;">*foo*</span> <span style="color: #006400;">(</span>+ 1 2<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>            <span style="color: #8B8989; font-style: italic;">; *foo* == 3</span>

<span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">defvar</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defvar</span> <span style="color: #ff69b4;">*bar*</span> 5<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">; *bar* = 5</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#37325;&#23450;&#20041;&#19981;&#25913;&#21464;&#20043;&#21069;&#23450;&#20041;&#26102;&#30340;&#20540;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defvar</span> <span style="color: #ff69b4;">*bar*</span> 6<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">; *bar* == 5</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#23450;&#20041;&#26102;&#21487;&#20197;&#19981;&#35774;&#32622;&#20540;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defvar</span> <span style="color: #ff69b4;">*bar*</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">; *bar* == Unbound</span>
</pre>
</div></li>
<li><p>
Local : let let*(可引用变量列表中早先引入的变量)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">let</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>a 5<span style="color: #ff1493;">)</span> &#1113093;
      <span style="color: #ff1493;">(</span>b 6<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>+ a b<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 11</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">let*</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let*</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>a 5<span style="color: #ff1493;">)</span>
       <span style="color: #ff1493;">(</span>b <span style="color: #ffff00;">(</span>+ a 2<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  b<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 7</span>
</pre>
</div></li>
</ul>

<p>
Constant 常量
</p>
<ul class="org-ul">
<li><p>
defconstant (命名约定: <code>+name+</code>)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defconstant</span> <span style="color: #ff69b4;">+name+</span> initial-value-form <span style="color: #006400;">(</span>doucmentation-string<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>  
</pre>
</div></li>
</ul>


<p>
Dynamic (Special) Variable  (!!! 注意命名)
</p>
<ul class="org-ul">
<li>all global variable are dynamic variable</li>
<li><p>
Lexical scope &amp; Dynamic extent variable 词法范围 和 动态作用域 变量
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Lexical scope variable</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>x 3<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">test</span> <span style="color: #ff1493;">()</span> x<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>test<span style="color: #8b0000;">)</span>                <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>x 5<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>test<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>  <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Dynamic extent variable</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defvar</span> <span style="color: #ff69b4;">*special*</span> 3<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">test</span> <span style="color: #006400;">()</span> *special*<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>test<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>*special* 5<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>test<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 5</span>


<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">!!! &#27880;&#24847;&#21629;&#21517; : &#21542;&#21017;&#38590;&#20197;&#20998;&#28165; &#21487;&#23548;&#33268;&#20351;&#29992;&#38169;&#35823;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defparameter</span> <span style="color: #ff69b4;">x</span> 3<span style="color: #8b0000;">)</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">test</span> <span style="color: #006400;">()</span> x<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>test<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>x 0<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>test<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>  <span style="color: #8B8989; font-style: italic;">;-&gt; 0</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>x 1<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">test</span> <span style="color: #ff1493;">()</span> x<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>test<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>x 0<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>test<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 0</span>
</pre>
</div></li>
<li><p>
Special: (declare (special ..))
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>y 1<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">test</span> <span style="color: #ff1493;">()</span> y<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>test<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 1</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>y 1<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">test</span> <span style="color: #ff1493;">()</span>
    <span style="color: #ff1493;">(</span><span style="color: #4c83ff;">declare</span> <span style="color: #ffff00;">(</span>special y<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
    y<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>test<span style="color: #8b0000;">)</span>  <span style="color: #8B8989; font-style: italic;">;-&gt; Error: Unbound y</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">progn</span> <span style="color: #006400;">(</span><span style="color: #4c83ff;">defparameter</span> <span style="color: #ff69b4;">y</span> 3<span style="color: #006400;">)</span>
       <span style="color: #006400;">(</span>test<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 3</span>
</pre>
</div></li>
</ul>
</div>
</div>
