articles/common-lisp-note.org
** 函数
- Lambda : 匿名函数
  #+BEGIN_SRC lisp
(lambda (n) (/ n 2))                   
;;-> #<Anonymous Function #x302000DB47EF>

;; Call
(funcall #'(lambda (x y) (+ x y)) 2 3) ;-> 5
((lambda (x y) (+ x y)) 2 3)           ;-> 5
((lambda () 42))                       ;-> 42
  #+END_SRC
- Name 命名
  - Global: defun
    #+BEGIN_SRC lisp
(defun name (arguments)
  "Optional document string"
  body-form)

(defun six () (+ 3 3))
(six) ;-> 6
    #+END_SRC
  - Local: flet labels(call another|recursion)
    #+BEGIN_SRC lisp
(flet ((f (n)
         (+ n 10))
       (g (n)
         (- n 3)))
  (g (f 5)))
;;-> 12

(labels ((a (n)
           (+ n 5))
         (b (n)
           (+ (a n) 6)))
  (b 10))
;;-> 21
    #+END_SRC
- Function Object: function (sugar:#')
  #+BEGIN_SRC lisp
;; 引用 符号命名的函数 (通常为 defun全局定义的)
(function car) ;-> #<Compiled-function CAR #x3000000FC18F>
#'car          ;-> #<Compiled-function CAR #x3000000FC18F>
  #+END_SRC
- 函数 既可以作为 定义抽象的方式 来产生抽象 也可以 作为一个抽象来使用
  - Higher-Order (first-class fun) : as paramater or return-value

*** Call
- apply | funcall
  #+BEGIN_SRC lisp
;; (最后一个参数需要是一个列表)
(apply (function car) '((x y))) ;-> X
(apply #'+ '(1 2 3 4 8))        ;-> 18
(apply #'+ 1 2 '(3))            ;-> 6

(funcall #'+ 1 3 5)    ;-> 9
(funcall #'car '(x y)) ;-> X
  #+END_SRC
- 局部函数的调用问题 : 先 局部  若使用 符号 而不是 #' 则 全局
  #+BEGIN_SRC lisp
(defun foo (x) (+ x 42))
(foo 0) ;-> 42
(funcall 'foo 0)                        ;-> 42
(funcall #'foo 0) ;-> 42

(flet ((foo (x) (1+ x)))
  (list (foo 0)                         ; Local
        (funcall 'foo 0)                ; Global
        (funcall #'foo 0)               ; Local
        ))
;;-> (1 42 1)
  #+END_SRC
