articles/common-lisp-note.html

<div id="outline-container-org2538d2f" class="outline-3">
<h3 id="org2538d2f"><span class="section-number-3">4.2</span> 函数</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><p>
Lambda : 匿名函数
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #006400;">(</span>n<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>/ n 2<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>                   
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; #&lt;Anonymous Function #x302000DB47EF&gt;</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Call</span>
<span style="color: #8b0000;">(</span>funcall #'<span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">(</span>x y<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">(</span>+ x y<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> 2 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 5</span>
<span style="color: #8b0000;">(</span><span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">(</span>x y<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">(</span>+ x y<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> 2 3<span style="color: #8b0000;">)</span>           <span style="color: #8B8989; font-style: italic;">;-&gt; 5</span>
<span style="color: #8b0000;">(</span><span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">()</span> 42<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>                       <span style="color: #8B8989; font-style: italic;">;-&gt; 42</span>
</pre>
</div></li>
<li>Name 命名
<ul class="org-ul">
<li><p>
Global: defun
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">name</span> <span style="color: #006400;">(</span>arguments<span style="color: #006400;">)</span>
  <span style="color: #FBDE2D;">"Optional document string"</span>
  body-form<span style="color: #8b0000;">)</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">six</span> <span style="color: #006400;">()</span> <span style="color: #006400;">(</span>+ 3 3<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>six<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 6</span>
</pre>
</div></li>
<li><p>
Local: flet labels(call another|recursion)
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">flet</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>f <span style="color: #ffff00;">(</span>n<span style="color: #ffff00;">)</span>
         <span style="color: #ffff00;">(</span>+ n 10<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
       <span style="color: #ff1493;">(</span>g <span style="color: #ffff00;">(</span>n<span style="color: #ffff00;">)</span>
         <span style="color: #ffff00;">(</span>- n 3<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>g <span style="color: #ff1493;">(</span>f 5<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 12</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">labels</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>a <span style="color: #ffff00;">(</span>n<span style="color: #ffff00;">)</span>
           <span style="color: #ffff00;">(</span>+ n 5<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
         <span style="color: #ff1493;">(</span>b <span style="color: #ffff00;">(</span>n<span style="color: #ffff00;">)</span>
           <span style="color: #ffff00;">(</span>+ <span style="color: #00ff00;">(</span>a n<span style="color: #00ff00;">)</span> 6<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>b 10<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 21</span>
</pre>
</div></li>
</ul></li>
<li><p>
Function Object: function (sugar:#')
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#24341;&#29992; &#31526;&#21495;&#21629;&#21517;&#30340;&#20989;&#25968; (&#36890;&#24120;&#20026; defun&#20840;&#23616;&#23450;&#20041;&#30340;)</span>
<span style="color: #8b0000;">(</span>function car<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; #&lt;Compiled-function CAR #x3000000FC18F&gt;</span>
#'car          <span style="color: #8B8989; font-style: italic;">;-&gt; #&lt;Compiled-function CAR #x3000000FC18F&gt;</span>
</pre>
</div></li>
<li>函数 既可以作为 定义抽象的方式 来产生抽象 也可以 作为一个抽象来使用
<ul class="org-ul">
<li>Higher-Order (first-class fun) : as paramater or return-value</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org31e32d2" class="outline-4">
<h4 id="org31e32d2"><span class="section-number-4">4.2.1</span> Call</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li><p>
apply | funcall
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">(&#26368;&#21518;&#19968;&#20010;&#21442;&#25968;&#38656;&#35201;&#26159;&#19968;&#20010;&#21015;&#34920;)</span>
<span style="color: #8b0000;">(</span>apply <span style="color: #006400;">(</span>function car<span style="color: #006400;">)</span> '<span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>x y<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; X</span>
<span style="color: #8b0000;">(</span>apply #'+ '<span style="color: #006400;">(</span>1 2 3 4 8<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>        <span style="color: #8B8989; font-style: italic;">;-&gt; 18</span>
<span style="color: #8b0000;">(</span>apply #'+ 1 2 '<span style="color: #006400;">(</span>3<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>            <span style="color: #8B8989; font-style: italic;">;-&gt; 6</span>

<span style="color: #8b0000;">(</span>funcall #'+ 1 3 5<span style="color: #8b0000;">)</span>    <span style="color: #8B8989; font-style: italic;">;-&gt; 9</span>
<span style="color: #8b0000;">(</span>funcall #'car '<span style="color: #006400;">(</span>x y<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; X</span>
</pre>
</div></li>
<li><p>
局部函数的调用问题 : 先 局部  若使用 符号 而不是 #' 则 全局
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>x<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>+ x 42<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo 0<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 42</span>
<span style="color: #8b0000;">(</span>funcall 'foo 0<span style="color: #8b0000;">)</span>                        <span style="color: #8B8989; font-style: italic;">;-&gt; 42</span>
<span style="color: #8b0000;">(</span>funcall #'foo 0<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 42</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">flet</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>foo <span style="color: #ffff00;">(</span>x<span style="color: #ffff00;">)</span> <span style="color: #ffff00;">(</span>1+ x<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>list <span style="color: #ff1493;">(</span>foo 0<span style="color: #ff1493;">)</span>                         <span style="color: #8B8989; font-style: italic;">; Local</span>
        <span style="color: #ff1493;">(</span>funcall 'foo 0<span style="color: #ff1493;">)</span>                <span style="color: #8B8989; font-style: italic;">; Global</span>
        <span style="color: #ff1493;">(</span>funcall #'foo 0<span style="color: #ff1493;">)</span>               <span style="color: #8B8989; font-style: italic;">; Local</span>
        <span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; (1 42 1)</span>
</pre>
</div></li>
</ul>
</div>
</div>
