articles/common-lisp-note.org
*** Paramater list
- &optional 可选
  #+BEGIN_SRC lisp
;;; Optional
(defun foo (a b &optional c d) (list a b c d))
(foo 1 2)     ;-> (1 2 NIL NIL) 
(foo 1 2 3)   ;-> (1 2 3 NIL)
(foo 1 2 3 4) ;-> (1 2 3 4)  
  #+END_SRC
- &key 关键字
  #+BEGIN_SRC lisp
;;; Keyword 
(defun foo (&key a b (c 3)) (list a b c))
(foo)                ;-> (NIL NIL 3)
(foo :b 1)           ;-> (NIL 1 3)
(foo :a 1 :b 2 :c 3) ;-> (1 2 3)

;; 区分外部和内部调用名
(defun foo (&key ((:apple a)) ((:box b) 0)) (list a b))
(foo :apple 1 :box 2)  

;; 关键字名 可不为 关键字
(defun baz (&key ((foo bar) 42))
           (list bar))
(baz 'foo 23) ;-> (23)
  #+END_SRC
- Default value 默认值
  #+BEGIN_SRC lisp
;;; Default Value
(defun foo (a &optional (b 10)) (list a b))
(foo 1 2) ;-> (1 2)
(foo 1) ;-> (1 10)

;; value 可以是任何 lisp 表达式

;; 可依赖前面的参数
(defun foo (a &optional (b a)) (list a b))
(foo 1 2) ;-> (1 2)
(foo 1) ;-> (1 1)
  #+END_SRC
- supplied-p : 用于判断是否提供了实参
  #+BEGIN_SRC lisp
;;; supplied-p
(defun foo (a &optional (c 3 c-supplied-p)) 
  (list a c c-supplied-p))
(foo 1)   ;-> (1 3 NIL)
(foo 1 3) ;-> (1 3 T)  
  #+END_SRC
- &rest
  #+BEGIN_SRC lisp
;;; rest 
(defun my+ (&rest nums)
  (apply #'+ nums))  
  #+END_SRC
- &aux : define auxiliary local variables
  #+BEGIN_SRC lisp
;;; auxiliary
(defun average (&rest args
                &aux (len (length args)))
  (/ (reduce #'+ args) len 1.0))
(average 1 2 3) ;-> 2.0
  #+END_SRC
- &allow-other-keys : 允许未定义的关键字参数 并收集于此

参数数量上限  
- call-arguments-limit
- lambda-parameters-limit

组合使用问题
- Order: required &optional &rest &key
  - &rest and &key
    #+BEGIN_SRC lisp
  ;;; &rest + &key : 只能使用key
(defun foo (&rest rest &key a b c) (list rest a b c))
(foo :a 1 :b 2 :c 3) ;-> ((:A 1 :B 2 :C 3) 1 2 3)
(foo :a 1) ;-> ((:A 1) 1 NIL NIL)
(foo 1 2) ;-> Error
(foo 1 2 :a 1) ;-> Error
(foo :a 2 1 2) ;-> Error
    #+END_SRC
- Avoid
  - &optional + &key
    #+BEGIN_SRC lisp
(defun foo (x &optional y &key z) (list x y z))
(foo 1 2 :z 3) ;-> (1 2 3)
(foo 1)        ;-> (1 nil nil) 
(foo 1 :z 3)   ;-> Error: Incorrect keyword arguments in (3) .
(foo 1 :z :z 3) ;-> (1 :Z 3)
    #+END_SRC
