articles/common-lisp-note.html
<div id="outline-container-orgbcd442a" class="outline-4">
<h4 id="orgbcd442a"><span class="section-number-4">4.2.2</span> Paramater list</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li><p>
&amp;optional 可选
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Optional</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>a b <span style="color: #afd8af;">&amp;optional</span> c d<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list a b c d<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo 1 2<span style="color: #8b0000;">)</span>     <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2 NIL NIL) </span>
<span style="color: #8b0000;">(</span>foo 1 2 3<span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2 3 NIL)</span>
<span style="color: #8b0000;">(</span>foo 1 2 3 4<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2 3 4)  </span>
</pre>
</div></li>
<li><p>
&amp;key 关键字
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Keyword </span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;key</span> a b <span style="color: #ff1493;">(</span>c 3<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list a b c<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo<span style="color: #8b0000;">)</span>                <span style="color: #8B8989; font-style: italic;">;-&gt; (NIL NIL 3)</span>
<span style="color: #8b0000;">(</span>foo <span style="color: #4c83ff;">:b</span> 1<span style="color: #8b0000;">)</span>           <span style="color: #8B8989; font-style: italic;">;-&gt; (NIL 1 3)</span>
<span style="color: #8b0000;">(</span>foo <span style="color: #4c83ff;">:a</span> 1 <span style="color: #4c83ff;">:b</span> 2 <span style="color: #4c83ff;">:c</span> 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2 3)</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#21306;&#20998;&#22806;&#37096;&#21644;&#20869;&#37096;&#35843;&#29992;&#21517;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;key</span> <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span><span style="color: #4c83ff;">:apple</span> a<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span><span style="color: #4c83ff;">:box</span> b<span style="color: #ffff00;">)</span> 0<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list a b<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo <span style="color: #4c83ff;">:apple</span> 1 <span style="color: #4c83ff;">:box</span> 2<span style="color: #8b0000;">)</span>  

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#20851;&#38190;&#23383;&#21517; &#21487;&#19981;&#20026; &#20851;&#38190;&#23383;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">baz</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;key</span> <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span>foo bar<span style="color: #ffff00;">)</span> 42<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
           <span style="color: #006400;">(</span>list bar<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>baz 'foo 23<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (23)</span>
</pre>
</div></li>
<li><p>
Default value 默认值
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Default Value</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>a <span style="color: #afd8af;">&amp;optional</span> <span style="color: #ff1493;">(</span>b 10<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list a b<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo 1 2<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2)</span>
<span style="color: #8b0000;">(</span>foo 1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 10)</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">value &#21487;&#20197;&#26159;&#20219;&#20309; lisp &#34920;&#36798;&#24335;</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#21487;&#20381;&#36182;&#21069;&#38754;&#30340;&#21442;&#25968;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>a <span style="color: #afd8af;">&amp;optional</span> <span style="color: #ff1493;">(</span>b a<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list a b<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo 1 2<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2)</span>
<span style="color: #8b0000;">(</span>foo 1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 1)</span>
</pre>
</div></li>
<li><p>
supplied-p : 用于判断是否提供了实参
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">supplied-p</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>a <span style="color: #afd8af;">&amp;optional</span> <span style="color: #ff1493;">(</span>c 3 c-supplied-p<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span> 
  <span style="color: #006400;">(</span>list a c c-supplied-p<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo 1<span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; (1 3 NIL)</span>
<span style="color: #8b0000;">(</span>foo 1 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 3 T)  </span>
</pre>
</div></li>
<li><p>
&amp;rest
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">rest </span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">my+</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;rest</span> nums<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>apply #'+ nums<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>  
</pre>
</div></li>
<li><p>
&amp;aux : define auxiliary local variables
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">auxiliary</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">average</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;rest</span> args
                <span style="color: #afd8af;">&amp;aux</span> <span style="color: #ff1493;">(</span>len <span style="color: #ffff00;">(</span>length args<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>/ <span style="color: #ff1493;">(</span>reduce #'+ args<span style="color: #ff1493;">)</span> len 1.0<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>average 1 2 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 2.0</span>
</pre>
</div></li>
<li>&amp;allow-other-keys : 允许未定义的关键字参数 并收集于此</li>
</ul>

<p>
参数数量上限  
</p>
<ul class="org-ul">
<li>call-arguments-limit</li>
<li>lambda-parameters-limit</li>
</ul>

<p>
组合使用问题
</p>
<ul class="org-ul">
<li>Order: required &amp;optional &amp;rest &amp;key
<ul class="org-ul">
<li><p>
&amp;rest and &amp;key
</p>
<div class="org-src-container">
<pre class="src src-lisp">  <span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">&amp;rest + &amp;key : &#21482;&#33021;&#20351;&#29992;key</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span><span style="color: #afd8af;">&amp;rest</span> rest <span style="color: #afd8af;">&amp;key</span> a b c<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list rest a b c<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo <span style="color: #4c83ff;">:a</span> 1 <span style="color: #4c83ff;">:b</span> 2 <span style="color: #4c83ff;">:c</span> 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; ((:A 1 :B 2 :C 3) 1 2 3)</span>
<span style="color: #8b0000;">(</span>foo <span style="color: #4c83ff;">:a</span> 1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; ((:A 1) 1 NIL NIL)</span>
<span style="color: #8b0000;">(</span>foo 1 2<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; Error</span>
<span style="color: #8b0000;">(</span>foo 1 2 <span style="color: #4c83ff;">:a</span> 1<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; Error</span>
<span style="color: #8b0000;">(</span>foo <span style="color: #4c83ff;">:a</span> 2 1 2<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; Error</span>
</pre>
</div></li>
</ul></li>
<li>Avoid
<ul class="org-ul">
<li><p>
&amp;optional + &amp;key
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">foo</span> <span style="color: #006400;">(</span>x <span style="color: #afd8af;">&amp;optional</span> y <span style="color: #afd8af;">&amp;key</span> z<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>list x y z<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>foo 1 2 <span style="color: #4c83ff;">:z</span> 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 2 3)</span>
<span style="color: #8b0000;">(</span>foo 1<span style="color: #8b0000;">)</span>        <span style="color: #8B8989; font-style: italic;">;-&gt; (1 nil nil) </span>
<span style="color: #8b0000;">(</span>foo 1 <span style="color: #4c83ff;">:z</span> 3<span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; Error: Incorrect keyword arguments in (3) .</span>
<span style="color: #8b0000;">(</span>foo 1 <span style="color: #4c83ff;">:z</span> <span style="color: #4c83ff;">:z</span> 3<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (1 :Z 3)</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
