articles/common-lisp-note.org
*** Return Value
- 返回值 Return value : 默认返回最后一个表达式的值
- 返回多值 Return Multi-Values : values values-list
  #+BEGIN_SRC lisp
;;; Return Multi-Values
(values 'a nil (+ 1 2));;-> a ;-> nil ;-> 3
;; 列表作为参数
(values-list '(1 2))
;;-> 1 ;-> 2

;; 返回值 传递
((lambda () 
   ((lambda () (values 1 2))))) ;;-> 1 ;-> 2
;; 多返回值作为参数 只有第一个被使用
((lambda (x) x)
  (values 1 2)) ;-> 1

;; 若不需要使用返回值
((lambda () (format t "~a" 1)))
;;-> 1 ;-> NIL
((lambda ()
   (format t "~a" 1)
   (values)))
;;-> 1 ;-> ; No value

;; (values) 不是 不返回值
(+) ;->0
(+ (values)) ; Error: The value NIL is not of the expected type NUMBER.
(null (values)) ;-> T
  #+END_SRC
- 处理多返回值
  - 多值绑定 : multipel-value-bind
    #+BEGIN_SRC lisp
(multiple-value-bind (a b) (values 2 3)
  (* a b))   ;-> 6
(multiple-value-bind (a b) (values 2 3 2)
  (* a b)) ;-> 6
(multiple-value-bind (a b c) (values 2 3)
  c)       ;-> nil
    #+END_SRC
  - 多值作为函数参数 : multiple-value-call
    #+BEGIN_SRC lisp
(funcall #'+ (values 1 2 3)) ;->1
(multiple-value-call #'+ (values 1 2 3)) ;-> 6

(funcall #'+ (values 1 2 3) (values 4 5 6)) ;-> 5
(multiple-value-call #'+ (values 1 2 3) (values 4 5 6)) ;-> 21
    #+END_SRC
  - 多值->列表 : multiple-value-list
    #+BEGIN_SRC lisp
(multiple-value-list (values 'a 'b 'c)) ;-> (A B C)
    #+END_SRC

*** Closures
- 闭包 Closures : 捕捉创建时的环境信息 : 捕获的是变量 不是值
  #+BEGIN_SRC lisp
(setf fn (let ((i 3)) #'(lambda (x) (+ x i))))
(funcall *fn*) ;-> 1
(funcall *fn*) ;-> 2
(funcall *fn*) ;-> 3

(let ((count 0))
  (list
   #'(lambda () (incf count))
   #'(lambda () (decf count))
   #'(lambda () count)))
  #+END_SRC


** 特殊操作符
** 宏
** 控制流
