articles/common-lisp-note.html
<div id="outline-container-org08c7317" class="outline-4">
<h4 id="org08c7317"><span class="section-number-4">4.2.3</span> Return Value</h4>
<div class="outline-text-4" id="text-4-2-3">
<ul class="org-ul">
<li>返回值 Return value : 默认返回最后一个表达式的值</li>
<li><p>
返回多值 Return Multi-Values : values values-list
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8B8989; font-style: italic;">;;; </span><span style="color: #8B8989; font-style: italic;">Return Multi-Values</span>
<span style="color: #8b0000;">(</span>values 'a nil <span style="color: #006400;">(</span>+ 1 2<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span><span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; a ;-&gt; nil ;-&gt; 3</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#21015;&#34920;&#20316;&#20026;&#21442;&#25968;</span>
<span style="color: #8b0000;">(</span>values-list '<span style="color: #006400;">(</span>1 2<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 1 ;-&gt; 2</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#36820;&#22238;&#20540; &#20256;&#36882;</span>
<span style="color: #8b0000;">(</span><span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">()</span> 
   <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #00ff00;">()</span> <span style="color: #00ff00;">(</span>values 1 2<span style="color: #00ff00;">)</span><span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 1 ;-&gt; 2</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#22810;&#36820;&#22238;&#20540;&#20316;&#20026;&#21442;&#25968; &#21482;&#26377;&#31532;&#19968;&#20010;&#34987;&#20351;&#29992;</span>
<span style="color: #8b0000;">(</span><span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">(</span>x<span style="color: #ff1493;">)</span> x<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>values 1 2<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 1</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#33509;&#19981;&#38656;&#35201;&#20351;&#29992;&#36820;&#22238;&#20540;</span>
<span style="color: #8b0000;">(</span><span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">()</span> <span style="color: #ff1493;">(</span>format t <span style="color: #61CE3C;">"~a"</span> 1<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 1 ;-&gt; NIL</span>
<span style="color: #8b0000;">(</span><span style="color: #006400;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ff1493;">()</span>
   <span style="color: #ff1493;">(</span>format t <span style="color: #61CE3C;">"~a"</span> 1<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span>values<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;;</span><span style="color: #8B8989; font-style: italic;">-&gt; 1 ;-&gt; ; No value</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">(values) &#19981;&#26159; &#19981;&#36820;&#22238;&#20540;</span>
<span style="color: #8b0000;">(</span>+<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;0</span>
<span style="color: #8b0000;">(</span>+ <span style="color: #006400;">(</span>values<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">; Error: The value NIL is not of the expected type NUMBER.</span>
<span style="color: #8b0000;">(</span>null <span style="color: #006400;">(</span>values<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; T</span>
</pre>
</div></li>
<li>处理多返回值
<ul class="org-ul">
<li><p>
多值绑定 : multipel-value-bind
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">multiple-value-bind</span> <span style="color: #006400;">(</span>a b<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>values 2 3<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>* a b<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>   <span style="color: #8B8989; font-style: italic;">;-&gt; 6</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">multiple-value-bind</span> <span style="color: #006400;">(</span>a b<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>values 2 3 2<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>* a b<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 6</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">multiple-value-bind</span> <span style="color: #006400;">(</span>a b c<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>values 2 3<span style="color: #006400;">)</span>
  c<span style="color: #8b0000;">)</span>       <span style="color: #8B8989; font-style: italic;">;-&gt; nil</span>
</pre>
</div></li>
<li><p>
多值作为函数参数 : multiple-value-call
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>funcall #'+ <span style="color: #006400;">(</span>values 1 2 3<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt;1</span>
<span style="color: #8b0000;">(</span>multiple-value-call #'+ <span style="color: #006400;">(</span>values 1 2 3<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 6</span>

<span style="color: #8b0000;">(</span>funcall #'+ <span style="color: #006400;">(</span>values 1 2 3<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>values 4 5 6<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 5</span>
<span style="color: #8b0000;">(</span>multiple-value-call #'+ <span style="color: #006400;">(</span>values 1 2 3<span style="color: #006400;">)</span> <span style="color: #006400;">(</span>values 4 5 6<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 21</span>
</pre>
</div></li>
<li><p>
多值-&gt;列表 : multiple-value-list
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>multiple-value-list <span style="color: #006400;">(</span>values 'a 'b 'c<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; (A B C)</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org97219f3" class="outline-4">
<h4 id="org97219f3"><span class="section-number-4">4.2.4</span> Closures</h4>
<div class="outline-text-4" id="text-4-2-4">
<ul class="org-ul">
<li><p>
闭包 Closures : 捕捉创建时的环境信息 : 捕获的是变量 不是值
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #8b0000;">(</span>setf fn <span style="color: #006400;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #ff1493;">(</span><span style="color: #ffff00;">(</span>i 3<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span> #'<span style="color: #ff1493;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ffff00;">(</span>x<span style="color: #ffff00;">)</span> <span style="color: #ffff00;">(</span>+ x i<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span>funcall *fn*<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 1</span>
<span style="color: #8b0000;">(</span>funcall *fn*<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 2</span>
<span style="color: #8b0000;">(</span>funcall *fn*<span style="color: #8b0000;">)</span> <span style="color: #8B8989; font-style: italic;">;-&gt; 3</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">let</span> <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span>count 0<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>list
   #'<span style="color: #ff1493;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ffff00;">()</span> <span style="color: #ffff00;">(</span>incf count<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
   #'<span style="color: #ff1493;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ffff00;">()</span> <span style="color: #ffff00;">(</span>decf count<span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
   #'<span style="color: #ff1493;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #ffff00;">()</span> count<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org3a65a93" class="outline-3">
<h3 id="org3a65a93"><span class="section-number-3">4.3</span> 特殊操作符</h3>
</div>
<div id="outline-container-orge0d0b72" class="outline-3">
<h3 id="orge0d0b72"><span class="section-number-3">4.4</span> 宏</h3>
</div>
<div id="outline-container-org27fd10a" class="outline-3">
<h3 id="org27fd10a"><span class="section-number-3">4.5</span> 控制流</h3>
</div>
</div>
</div>
</body>
</html>
